Repository: giellalt/corpus-nob
Catalog: prestable/tmx/sme/science/samilogut/2017/4_samisk_som_andresprak.pdf.tmx
Source language: nob
Languages: sme

source: 4 Samisk som andrespråk
sme: 4 Sámegiella nubbingiellan

source: Seniorrådgiver hos Fylkesmannen i Nordland
sme: Seniorráđđeaddi Nordlándda Fylkkamánnis

source: Sammendrag: Samisk som andrespråk har vært sterkt vektlagt av politikere og de som arbeider med samiskopplæring.
sme: Čoahkkáigeassu: Politihkkarat ja sii geat barget sámegieloahpahusain leat ollu fuomášuhttán nubbingielat sámegiela.

source: Det har vært interesse for både elevtallsutvikling og i hvilken grad elevene oppnår tospråklighet.
sme: Leat ollu beroštan ohppiidlogoovdáneamis ja man muddui oahppit olahit guovttegielatvuođa.

source: I denne artikkelen har jeg sett på elevtallsutviklinga de siste ti år.
sme: Dán artihkkalis lean geahčadan ohppiidlogoovdáneami dan maŋemus logi jagis.

source: Den viser en betydelig nedgang for nord- og sørsamisk, men en markant oppgang for lulesamisk.
sme: Dat čájeha ahte lea hirbmadit njiedjan davvi- ja lullisámegielas, ja mearkkašahtti ollu lassánan julevsámegielas.

source: Hvis man ser utviklinga de siste fem årene, har imidlertid nedgangen stoppet opp, og elevtallene har stabilisert seg for nord- og sørsamisk.
sme: Jus geahččat dan vihtta maŋemus jagi ovdáneami, de oaidnit ahte davvi- ja lullisámegielas lea njiedjan bisánan ja ohppiidlohku lea stáđásmuvvan.

source: For lulesamisk har oppgangen fortsatt, men noe svakere enn de fem årene før det.
sme: Julevsámegielas lea lassáneapmi joatkkašuvvan, muhto ii šat nu ollu go dan vihtta vuosttaš jagi.

source: Artikkelen finner ikke grunnlag for å påstå at de fleste andrespråkselevene ikke blir tospråklige.
sme: Artihkkalis ii leat vuođđu dadjat ahte eanas nubbingielatoahppit eai šatta guovttegielagiin.

source: Dette kommer av de gode karakterene andrespråkselevene gjennomgående oppnår i faget, som er langt bedre enn karakterene i både norsk hovedmål og sidemål i Nord-Norge.
sme: Dat boahtá das go nubbingielatohppiin leat dássedis buorit árvosánit fágas, ja dat leat ollu buorebut go árvosánit Davvi-Norgga dárogiela váldogielas ja nubbingielas.

source: Spesielt i muntlig skårer samiskelevene godt.
sme: Earenoamážiid njálmmálaččat nagodit sámegieloahppit bures.

source: Språkopplæring tar tid, og artikkelen viser til internasjonal forskning som viser at det er en myte at barn nødvendigvis lærer språk så mye raskere enn voksne under ellers like vilkår.
sme: Giellaoahpahallan váldá áiggi ja artihkal čujuha riikkaidgaskasaš dutkamii, mii čájeha ahte lea myhta ahte mánát ohppet giela nu ollu jođáneappot go rávis olbmot, dalle go leat seammalágan eavttut oahppamii.

source: Tålmodighet i språkopplæringa er derfor viktig.
sme: Gierdevašvuohta lea mávssolaš giellaoahpahallamis.

source: Samtidig er det viktig å ha fokus på gode metoder for andrespråksopplæring og derfor vil kompetanseheving for samisklærere, spesielt i Ulpan-metoden, kunne ha stor innflytelse på læringsutbyttet for samiskelever.
sme: Seammás lea dehálaš fuomášuhttit buriid vugiid nubbingielatoahpahussii. Danne lea sámegieloahpaheddjiide ávkkálaš gelbbolašvuođa loktet, earenoamážiid Ulpan-vuohki livčče hui ávkkálaš sámegieloahpahallamii sámegielat ohppiide.

source: 4.1 Innledning
sme: 4.1 Álggahus

source: I denne artikkelen vil vi se på elevtallsutviklinga i samisk som andrespråk i grunnskolen i Norge etter at det nye læreplanverket Kunnskapsløftet LK06 ble utvikla.
sme: Dán artihkkalis áigut geahččat sámegiela nubbingielat ohppiidlogu ovdáneami vuođđoskuvllain Norggas, maŋŋil go ođđa oahppoplána Máhttolokten LK06 ráhkaduvvui.

source: Artikkelen vil se på lovverket som gir samiske elever rett til opplæring i samisk, innholdet i læreplanen for samisk som andrespråk og hvordan elevtallsutviklinga har vært for samisk som andrespråk.
sme: Artihkal geahčada láhkaásahusa, mii addá sámegielat ohppiide rievtti oahppat sámegiela, sámegiela nubbingielat oahppoplána sisdoalu ja movt sámegiela nubbingielat ohppiidlohku lea ovdánan.

source: Deretter vil vi drøfte årsaker til elevtallsutviklinga og i hvilken grad kompetansemålene i læreplanen oppnås.
sme: Dasto áigut guorahallat sivaid ohppiidlogu ovdáneapmái ja man muddui oahppoplána gelbbolašvuođamihtut olahuvvojit.

source: På bakgrunn av dette vil ulike mulige metoder for å styrke samiskopplæringa i andrespråk diskuteres.
sme: Dieinna duogážiin áigut digaštallat iešguđetlágan vugiid mainna nanne nubbingielat sámegieloahpahusa.

source: I avslutninga av artikkelen blir tilrådinger skissert.
sme: Loahpas dán artihkkalis ovdanbuktit neavvagiid dan ektui.

source: 4.1.1 Lovhjemmel
sme: 4.1.1 Láhkavuođđu

source: Opplæringsloven kapittel seks regulerer rettigheter for samisk opplæring i Norge.
sme: Oahpahuslága kapihttal guhtta ásaha rievtti sámegiel oahpahussii Norggas.

source: § 6-2 sier: I samiske distrikt har alle i grunnskolealder rett til opplæring i og på samisk.
sme: § 6-2 cealká: «Sámi guovlluin lea buohkain vuođđoskuvlla ahkásaččain riekti oažžut oahpahusa sámegielas ja sámegillii.

source: Utanfor samiske distrikt har samar i grunnskolealder rett til opplæring i samisk.
sme: Olggobealde sámi guovlluid lea vuođđoskuvlla ahkásaš sápmelaččain riekti oažžut oahpahusa sámegielas.

source: Departementet kan gi forskrifter om alternative former for slik opplæring når opplæringa ikkje kan givast med eigna undervisningspersonale på skolen.
sme: Departemeanta sáhttá láhkaásahusaid bokte mearridit molssaevttolaš oahpahusvugiid go oahpahusa ii sáhte fállat skuvlla iežas oahpaheddjiiguin».

source: Opplæringslovutvalget og departementet behandla grundig spørsmålet om samisk opplæring i henholdsvis NOU 1995: 18 og Prp. 46. Langt på veg bygger reglene på den tidligere grunnskoleloven § 40 a.
sme: Oahpahusláhkalávdegoddi ja departemeanta meannudedje vuđolaččat sámegieloahpahus gažaldaga NOU 1995: 18 ja Prp. 46 vuođul. Ollu njuolggadusat leat huksejuvvon ovddit vuođđoskuvlalága § 40 a ektui.

source: I NOU 1995: 18 s. 254–258 presiseres at det i forbindelse med opplæring i og på samisk er viktig å ta utgangspunkt i grunnskolelova § 108, samt i de folkerettslige forpliktelser Norge har.
sme: NOU 1995: 18 s. 254–258 dárkkuha ahte go guoská oahpahussii sámegielas ja sámegillii, de lea mávssolaš vuolggasadji Vuođđolágas § 108, ja dat álbmotrievttalaš geatnegasvuođat mat Norggas leat.

source: Alle samiske elever har rett til samiskopplæring i Norge.
sme: Buot sápmelaš ohppiin lea riekti sámegieloahpahussii Norggas.

source: Denne retten er ubestridelig og avhenger således ikke av om skoleeier kan skaffe lærere, osv. Det er også slik at eleven sjøl velger hvilket samisk språk de vil ha opplæring i.
sme: Dan rievtti ii sáhte gieldit ja lea sorjjasmeahttun dasa ahte nagoda go skuvlaeaiggát háhkat oahpaheddjiid vai ii ja nu ain. Lea maid nu ahte oahppi ieš mearrida makkár sámegielas áigu oahpahusa.

source: Fra og med åttende trinn kan eleven sjøl velge om hun/han fortsatt skal ha samiskopplæring, på lik linje med at elevene sjøl velger hvilken målform de skal ha som hovedmål og sidemål.
sme: Gávccát klássa rájes sáhttá oahppi ieš válljet jus áigu joatkit sámegieloahpahusain seamma ládje go oahppit ieža válljejit makkár giela áigot vuosttašgiellan ja nubbingiellan.

source: 4.1.2 Historisk tilbakeblikk på læreplanverk i skolen
sme: 4.1.2 Ruovttoluottageahčastat skuvlla oahppoplánaid historjái

source: Helt tilbake til 1959 sa folkeskoleloven at samisk kunne brukes som opplæringsspråk etter bestemmelse fra departementet.
sme: 1959 rájes celkkii álbmotskuvlaláhka ahte sámegiela galgá sáhttit atnit oahpahusgiellan nugo departemeanta lei mearridan.

source: Det tok noen år før dette ble praksis, og det var også misnøye fra samisk hold med at det samiske ikke kom sterkere med i utkastene til Mønsterplanen for grunnskolen fra 1974, M74.
sme: Manai muhtin jagiid ovdal go praktihkalaččat doaimmahuvvui ja sápmelaččaid bealis moite go sámegiella ii boahtán čielgaseappot ovdán Vuođđoskuvlla minsttarplána 1974 – M74 álgoárvalussii.

source: Da M74 ble vedtatt, sto det i forordet:
sme: Go M74 mearriduvvui, de čuoččui álgosánis ná:

source: I samsvar med ønsker som er kommet fram i Stortinget og på annet hold, er innslaget om samisk kultur og historie styrket gjennom hele planen.
sme: «Sávaldagaid ektui mat leat boahtán ovdán Stuoradikkis ja eará sajiin, de lea sámi kultuvra ja historjá nannejuvvon olles plánas.»

source: Det neste læreplanverket, Mønsterplanen for grunnskolen fra 1987, M87, la til grunn at M74 ikke tok høyde for opplæring for samiske elever tuftet på samisk språk og kultur.
sme: Nubbi oahppaplána, Vuođđoskuvlla minsttarplána 1987 – M87, vuođđuduvvui dan ala ahte M74 sápmelaš ohppiin váillui oahpahus, mii lei vuođđuduvvon sámi giela ja kultuvrra ala.

source: M87 slo fast:
sme: M87 deattuhii:

source: Skoletilbudet for samiske barn bygger på det grunnleggende prinsipp at skolen skal være en integrert del av samfunnet.
sme: “Skuvlafálaldat sámi mánáide huksejuvvo dan vuđolaš prinsihpas ahte skuvla galgá leat fátmmasteaddji oassin servodagas.

source: Samenes etniske identitet, knyttet til sosiale og kulturelle forhold, danner en viktig forutsetning for læring.
sme: Sápmelaččaid čearddalaš identitehta, mii lea čadnon sosiála ja kultuvrralaš dilálašvuođaide, ásaha mávssolaš eavttuid oahppamii.

source: Ved å ta utgangspunkt i den samiske kulturen vil skolen på den ene side styrke elevenes identitetsfølelse og selvtillit, og på den andre side være med på å bevare og videreutvikle den samiske kulturarven.
sme: Go sámi kultuvra lea vuolggasadjin, de skuvla nanne ohppiid identitehtadovddu ja iešluohttámuša, ja nuppe dáfus fas seailluha ja ovdánahttá sámi kulturárbbi.

source: 1987 var også året da andrespråksopplæring i samisk ble innført i Norge.
sme: ” 1987 lei maid jahki go nubbingielat oahpahus ásahuvvui Norggas.

source: Målsettingen var at elevene skulle bli funksjonelt tospråklige.
sme: Ulbmil lei ahte oahppit galge šaddat doaibmi guovttegielagiin.

source: Sjøl om flere hevder at skolen i praksis ikke oppfylte målsettingene nedfelt i M87, gir dette likevel et signal om at det samiske skulle tas mer på alvor i den nasjonale skolen.
sme: Vaikko máŋggas oaivvildit ahte skuvla duohtadilis ii ollašuhttán M87 ulbmiliid, de addá dat signála ahte sámevuohta galggai eambbo duođas váldot našuvnnalaš skuvllas.

source: 1997 var imidlertid det kanskje viktigste merkeåret i samisk skolehistorie.
sme: 1997 lea goitge dat mávssoleamos mearkajahki sámi skuvlahistorjjás.

source: Da fikk samiske elever et eget læreplanverk, L97S, som skulle være likeverdig med de nasjonale læreplanene.
sme: De ožžo sápmelaš oahppit sierra oahppoplána, L97S, mii galggai leat dássálaga našuvnnalaš oahppoplánaiguin.

source: Et likeverdig læreplanverk betydde ikke at det skulle være identisk.
sme: Ovttaárvosaš oahppoplána mearkkaša ahte ii dárbbaš leat juste seammalágan.

source: Den samiske læreplanen skulle blant annet legge vekt på særskilte kompetansebehov i samiske samfunn.
sme: Sámi oahppoplána galggai earret eará fuomášuhttit sierralágan gelbbolašvuođadárbbuid sámi servodagas.

source: Ole Henrik Magga, som på det tidspunktet enda var sametingspresident, beskriver i sin artikkel «Den samiske læreplanen for grunnskolen – en arbeidsulykke?
sme: Ole Henrik Magga, gii dalle lei vuos sámediggepresideanta, čilge artihkkaliiddis Den samiske læreplanen for grunnskolen – en arbeidsulykke?

source: » (1999) prosessen fram til at læreplanen ble et faktum.
sme: (1999) movt oahppoplánaproseassa šattai duohtan.

source: L97S ble ikke til uten betydelig arbeidsinnsats fra Sametinget og daværende Samisk utdanningsråd.
sme: L97S ii šaddan Sámedikki ja dalá Sámi oahpahusráđi rahčamušaid haga.

source: L97S skulle dyktiggjøre samiske elever til å fungere både i samiske samfunn og i storsamfunnet.
sme: L97S galggai dahkat sámi ohppiid čeahpibun doaibmat sihke sámi servodagas ja stuora servodagas.

source: Imidlertid ville ikke alle samiske elever få anledning til å følge den samiske læreplanen.
sme: Goitge ii lean vejolašvuohta buot sámi ohppiin čuovvut sámi oahppoplána.

source: Det ble avgjort at de som bodde i forvaltningsområdet for samisk språk, skulle benytte den.
sme: Mearriduvvui ahte sii geat orrot sámegiela hálddašanguovllus sáhtte čuovvut dan.

source: Dette skapte betydelige reaksjoner fra enkelte foreldre i blant annet Tana, og det førte til opprettinga av en privatskole i bygda.
sme: Dat dagahii hirbmat reakšuvnna muhtin váhnemiin earret eará Deanus, mii maid mielddisbuvttii ahte dohko ásahedje priváhtaskuvlla.

source: Utenfor forvaltningsområdet fulgte samiske elever det nasjonale læreplanverket L97, men fulgte samisk læreplan i faget samisk.
sme: Olggobealde sámegiela hálddašanguovllu čuvvo sámi oahppit našuvnnalaš oahppoplána L97, muhto čuvvo sámi oahppoplána sámegielfágas.

source: Man kan hevde at dette førte til ei forskjellsbehandling av samiske elever.
sme: Sáhttá dadjat ahte dan dihte sámi oahppit vealahuvvojedje.

source: Samtidig ville det vært krevende for lærere å forholde seg til elever som fulgte to ulike læreplanverk i samme klasserom.
sme: Seammás livčče oahpaheddjiide šaddan gáibideaddjin go muhtin oahppit seamma klássalanjas čuvvot guokte oahppoplána.

source: I det nasjonale læreplanverket skulle det imidlertid være «samiske stolper» med mål for hva elevene skulle lære om samiske forhold.
sme: Našuvnnalaš oahppoplánas galge leat “sámi stoalpput” maid mihttu galggai leat dat maid oahppit galge oahppat sámi dilálašvuođaid birra.

source: I Norge har det vært tradisjon for med jevne mellomrom å gjennomføre skolereformer.
sme: Norggas lea leamaš árbevierru gaskkohagaid čađahit skuvlaođastusaid.

source: I juni 2004 vedtok Stortinget reform i grunnskolen og videregående opplæring.
sme: Geassemánu 2004 mearridii Stuoradiggi reforpma vuođđoskuvlii ja joatkkaskuvlii.

source: Denne reformen førte til Kunnskapsløftet LK06 og LK06S for forvaltningsområdet for samisk språk.
sme: Dát reforbma mielddisbuvttii Máhttoloktema LK06 ja LK06S sámegiela hálddašanguvlui.

source: Artikkelforfatteren var prosjektleder i Sametinget med ansvar for å sikre det samiske innholdet i Kunnskapsløftet og kjenner det således fra innsiden.
sme: Artihkalčálli lei Sámedikki prošeaktajođiheaddji, geas lei ovddasvástádus sihkkarastit sámi sisdoalu Máhttoloktemii ja dakko bokte dovdá bures dan siskkáldasat.

source: Arbeidet med L97S medførte at mye av de juridiske avklaringene for et samisk likeverdig læreplanverk alt var avklart.
sme: L97S bargu mielddisbuvttii ahte sámi ovttadássásaš oahppoplána ektui ledje ollu juridihkalaš čielggadeamit juo čielggaduvvon.

source: Derfor var ikke dette noe det måtte arbeides mye med ved utarbeidingen av de likeverdige parallelle samiske læreplanene.
sme: Danne eai dárbbašan daiguin bargat nu ollu go ráhkadedje ovttadássásaš buohtalas oahppoplánaid.

source: I LK06 er det nedfelt kompetansemål som elevene skal oppnå i opplæringsløpet.
sme: LK06 lea biddjon gelbbolašvuođamihttu maid oahppit galget olahit oahpahusas.

source: Læreplanene har status som forskrift slik at elevene har rett til å få opplæring til de ulike kompetansemålene.
sme: Oahppoplánat lea láhkaásahusa stáhtus, vai ohppiin lea riekti oažžut oahpu dain iešguđet gelbbolašvuođamihtuin.

source: I hvilken grad kompetansemålene faktisk blir innfridd, vil vi komme tilbake til seinere i artikkelen.
sme: Man muddui gelbbolašvuođamihtut olahuvvojedje, dan birra mii ságastallat maŋŋelis artihkkalis.

source: Man kan hevde at L97S var banebrytende for samiskopplæring, siden læreplanen for samiske elever var noe helt annet enn tidligere læreplaner.
sme: Sáhttá lohkat ahte L97S lei ovdavázzin sámegieloahpahussii, go oahppoplána sámi ohppiide lei áibbas earálágan go ovdal lei leamaš.

source: Samtidig hadde LK06 en enda sterkere vektlegging av samisk.
sme: Seammás lei LK06 sámevuohta nannosit deattuhuvvon.

source: Aldri før hadde det vært så mange samiske kompetansemål i et læreplanverk.
sme: Eai goassige ovdal lean leamaš nu eatnat sámi gelbbolašvuođamihtut oahppoplánas.

source: På dette tidspunktet slo opplæringsloven fast at Sametinget hadde myndighet til å fastsette samiske kompetansemål i nasjonale læreplaner innenfor rammer og omfang gitt av departementet.
sme: Dan áigodagas daddjui ahte Sámedikkis lei váldi mearridit gelbbolašvuođamihtuid našuvnnalaš oahppoplánaide daid rámmaid ja viidodaga siskkobealde maid departemeanta lea addán.

source: Når det gjelder læreplanene i samisk språk, ble de fastsatt av Sametinget.
sme: Go guoská oahppoplánaide sámegiela ektui, de daid mearrida Sámediggi.

source: Da læreplanutkastene ble lagt ut til høring, skapte det økte innholdet av samiske kompetansemål sterke reaksjoner i media.
sme: Go oahppoplánaálgoárvalusat biddjojedje gulaskuddamii, de dat lasihuvvon sámi gelbbolašvuođamihtut dagahedje rieja medias.

source: Flere mente at det var altfor mye samisk innhold.
sme: Oallugat oaivvildedje ahte lei beare ollu sámi sisdoallu.

source: Noen mente dette var politisk overkorrekt, andre mente Sametinget hadde fått altfor stor makt i læreplanarbeidet.
sme: Muhtimat ges oaivvildedje ahte lei politihkalaš badjelmearálašvuohta, ja earát fas oaivvildedje ahte Sámedikkis lei beare ollu fápmu oahppoplánabarggus.

source: Undertegnede sammenfattet høringen av flere av læreplanene for Utdanningsdirektoratet.
sme: Artihkkala čálli lea čoahkkáigeassán máŋga oahppoplána Oahpahusdirektoráhta ovddas.

source: Blant dem som avga høringsuttalelse, var det ei unison holdning at det samiske hadde fått for stor plass i læreplanverket.
sme: Ledje earret eará sii, geat bukte cealkámuša gulaskuddamis, geat oaivvildedje ahte sámevuohta lei ožžon beare stuora saji oahppoplánas.

source: Spesielt læreplanene i norsk, der elevene også skulle lære samiske bokstaver, og læreplanen i historie med fem samiske kompetansemål vakte reaksjoner.
sme: Reakšuvnnaid dagahedje earenoamážiid dárogiela oahppoplánas, mas oahppit galge maid oahppat sámi bustávaid, ja historjjá oahppoplánas mas ledje vihtta sámi gelbbolašvuođamihtu.

source: Da LK06 ble vedtatt, var derfor det samiske innholdet noe redusert sammenliknet med høringsutkastet, men omfanget av samisk innhold var likevel mer omfattende enn i noe tidligere læreplanverk.
sme: Go LK06 mearriduvvui, de lei dan geažil sámi sisdoallu unniduvvon gulaskuddanárvalusa ektui, muhto goitge lei sámi sisdoallu eambbo viidát go goassege ovdal lei leamaš oahppoplánas.

source: Det mest interessante i debatten var likevel ikke reaksjonene som kom fra voksne, men den betydelige forskjellen i tilnærmingsmåte til samiske spørsmål mellom generasjonene.
sme: Eanemus beroštahtti áššit digaštallamis eai lean reakšuvnnat rávis olbmuin, muhto dat stuora erohusat das movt buolvvaid gaskkas lahkonedje sámi gažaldagaide.

source: Alle skoleelever som ble intervjuet i de mange nyhetsreportasjene om saken, var udelt positive til å lære mer om samiske forhold.
sme: Buot oahppit, geaid jearahalle dán áššis daid oallut ođasreportášaiguin ledje eanas positiivvalaččat, go besse oahppat eambbo sámi dilálašvuođaid birra.

source: 4.2 Læreplaner i samisk som andrespråk
sme: 4.2 Sámegiela nubbingielat oahppoplánat

source: Læreplanene i samisk språk var det derimot ingen reaksjoner mot i høringen.
sme: Sámegiela oahppoplánaide ii lean makkárge reakšuvdna gulaskuddamis.

source: Departementet avgjorde at de samiske læreplanene skulle være «likeverdige, parallelle læreplaner» og således ha samme status som læreplanene i norsk.
sme: Departemeanta mearridii ahte sámegiela oahppoplánat galge leat “ovttaárvosaččat, buohtalas oahppoplánat” ja nu de lea seamma stáhtus go dárogiela oahppoplánain.

source: De samiske læreplanene skulle være gjennomgående, det vil si at de omfattet hele grunnopplæringa fra Vg1 til siste år på videregående.
sme: Sámi oahppoplánat galge sisttisdoallat olles vuođđooahpahusa Jk1 rájes gitta maŋemus jahkái joatkkaskuvllas.

source: Imidlertid var det en sentral forskjell på de samiske læreplanene og nasjonale læreplaner.
sme: Goitge lei guovddáš erohus sámi oahppoplánain ja našuvnnalaš oahppoplánain.

source: Sametinget tok høyde for det faktum at samiske barn begynner med samiskopplæring i skolen til ulike tidspunkt.
sme: Sámediggi oaivvildii ahte sámi mánát oahppagohtet sámegiela skuvllas iešguđet agis.

source: I andre fag følger man oppsettet med at man begynner med faget på det og det trinnet.
sme: Eará fágain čuovvu dan fága oahpahusa duon ja duon klássa rájes.

source: Samiske elever kan i prinsippet begynne med samisk på alt fra første til tiende klasse, og til og med motta begynneropplæring i samisk på videregående med den nye læreplanen samisk 4. På bakgrunn av dette ble de samiske læreplanene ikke trinninndelt, men nivå inndelt.
sme: Sámegiela oahppit sáhttet prinsihpalaččat álgit sámegielain vuosttaš gitta logát klássa rájes, ja goitge beassat álgit álggahalli oahpahussii sámegielas joatkkaskuvllas dainna ođđa sámegiela 4 oahppoplánain. Dainna duogážiin eai juhkkojuvvon sámegiela oahppoplánat cehkiid mielde, muhto dásiid mielde.

source: Læreplanen er delt inn i nivå 1b, 2b og 3b (som gjelder for barnetrinnet), deretter nivå 1–9. Det vil si at en førsteklassing som begynner med samisk, da starter på 1b.
sme: Oahppoplána lea juhkkon dásiid mielde, nugo 1b, 2b ja 3b (mii guoská mánáidceahkkái), dasto dássi 1-9. Dat mearkkaša ahte vuosttaš klássa mánná, mii oahppagoahtá sámegiela álgá 1b.

source: Dette er begynneropplæring der eleven ofte ikke kan lese og skrive enda.
sme: Dat lea álggahalli oahpahus mas oahppi dávjá ii máhte vuos lohkat ja čállit.

source: En femteklassing som begynner med samisk, begynner på nivå 1, som er det fjerde laveste nivået, men som ikke lenger er begynneropplæring i lesing og skriving.
sme: Viđat klássa mánná gii álgá sámegieloahpahusain, álgá dássi 1, mii leat dat njealját vuolemus dássi, mii ii leat šat álggahallioahpahus lohkamis ja čállimis.

source: Totalt sett har vi tre læreplaner i samisk som andrespråk: Samisk som andrespråk 2 (som er den andrespråklæreplanen som legger til grunn høgest måloppnåelse), Samisk som andrespråk 3 (som erstattet den tidligere læreplanen i samisk språk og kultur) og Samisk som andrespråk 4 (som er beregnet for dem som begynner med samisk i videregående opplæring).
sme: Sámegiela nubbingiella 2, lea dat nubbingielat oahppoplána mii vuođđuduvvo dan ala ahte joksá alimus mihtuide. Sámegiela nubbingiella 3 (mii bođii sámi giela ja kultuvrra oahppoplána sadjái) ja sámegiela nubbingiella 4, mii lea ovdal juo namuhuvvon, lea oaivvilduvvon sidjiide geat álget sámegielain joatkkaskuvllas.

source: De samiske læreplanene er ellers bygget opp som øvrige læreplaner med formål, grunnleggende ferdigheter i muntlig, skriftlig, lesing, regning og i bruk av digitale verktøy.
sme: Sámegiela oahppoplánat leat muđui huksejuvvon nugo eará nai oahppoplánat, maid ulbmil lea oahppat vuođđomáhttu njálmmálaččat, čálalaččat, lohkamis, rehkenastimis ja go geavaha digitála veahkkeneavvuid.

source: I formålet til læreplanen står det:
sme: Oahppoplána ulbmiliin čuožžu:

source: Faget samisk som andrespråk skal sammen med faget norsk legge grunnlaget for utvikling av elevenes funksjonelle tospråklighet, og bidra til at den enkelte elev får kunnskaper, motivasjon og trygghet til å velge samisk som kommunikasjonsspråk.
sme: Sámegielfága nubbingiellan galgá searválaga dárogielfágain addit vuođu ohppiid doaibmi guovttegielatvuhtii, ja leat veahkkin dasa ahte juohke oahppi oažžu máhtu, movtta ja oadjebasvuođa válljet sámegiela gulahallangiellan.

source: For elever med tospråklig opplæring er det derfor viktig med et nært samarbeid mellom de to fagene.
sme: Ohppiin geain lea guovttegielat oahpahus lea dan dihte dehálaš ahte diet guovtti fágas lea lagas ovttasbargu.
